package homeworks.extra_hw2_collections.task_6;

/*
Продолжаем разработку интерфейса BookDatabase.

        Добавьте в интерфейc BookDatabase следующий метод:

        Optional<Book> findById(Long bookId);

        Данный метод предназначен для поиска книги с указанным id в качестве параметра
        метода в базе данных. Медот возвращает Optional.of(book) если книга была найдена
        в базе данных, иначе Optional.empty().

        Перед реализацией данного метода прочитайте про класс Optional и узнайте
        для чего он был создан и как применяется.

        Реализуйте данный метод и протестируйте его.
*/

public class Task_9 {
}
